app/controllers/api_controller.rb

  def get_token
  	# do LDAP authentication with the password
  	# also save s.number (your student id e.g. 473718)
  	# s.number = 473718
  	pass_correct = true
  	number = 473718 if params['user'] == 'burfordan18'
  	number = 471818 if params['user'] == 'livi18'
  	if pass_correct
  		s = Student.find_by(username: params['user'])
  		s ||= Student.create(username: params['user'], number: number)
---
INSERT INTO `students` (`username`, `auth_token`, `created_at`, `updated_at`) VALUES ('burfordan18', '563f013c7f87472fb02d00516b417b7f', '2018-05-29 13:39:08', '2018-05-29 13:39:08')

  def present
  	student = authenticate
		# passing an array to .where() will automatically loop through all values
		json = JSON.parse(params['hashes'])
		puts 'parsed json:'
		p json
		hashes = []

		json.each do |values|
			hashes << HashValue.find_by(value: values['uuid'], major: values['major'], minor: values['minor'])
		end
		hashes.each do |h|
			pr = student.presences.find_by(class_session: h.class_session)
			pr.attendance_code = h.attendance_code
			pr.save
---
SELECT  `hash_values`.* FROM `hash_values` WHERE `hash_values`.`value` = '94de9c242c60085bb796d84d085edcb3' AND `hash_values`.`major` = 'afd2' AND `hash_values`.`minor` = '000d' LIMIT 1
SELECT  `presences`.* FROM `presences` WHERE `presences`.`student_id` = 3 AND `presences`.`class_session_id` = 5 ORDER BY `presences`.`id` ASC LIMIT 1
UPDATE `presences` SET `attendance_code_id` = 1, `updated_at` = '2018-05-30 12:06:23' WHERE `presences`.`id` = 1