app/controllers/api_controller.rb

  def present
  	student = authenticate
		# passing an array to .where() will automatically loop through all values
		hashes = HashValue.where(value: JSON.parse(params["hashes"]))
		hashes.each do |h|
			p = student.presences.where(class_session: h.class_session).first
---
SELECT `hash_values`.* FROM `hash_values`
SELECT  `presences`.* FROM `presences` WHERE `presences`.`student_id` = 3 AND `presences`.`class_session_id` = 5 LIMIT 11